ggurov/round-1.28-gauge/firmware/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Waveshare ESP32-S3-LCD-1.28  (ESP32-S3R2, 16 MB flash, 2 MB in-package PSRAM)
#
# No graphics library.  The gauge draws into a plain RGB565 framebuffer in the
# gfx component; see README.md for why LVGL was dropped.
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: Winbond W25Q128JV, 16 MB, quad -----------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_BEFORE_RESET=y
CONFIG_ESPTOOLPY_AFTER_RESET=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# esptool cannot reset this board into the bootloader (DTR is not wired to the
# boot strap), so do not waste time on a reset sequence that goes nowhere.
# Use the `bootloader` console command instead.
CONFIG_ESPTOOLPY_BEFORE_NORESET=y

# --- Partition table ---------------------------------------------------------
# A factory slot plus two OTA slots; see partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- CPU / RTOS --------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# --- Console on UART0 (routed to the CH343P -> COM port) ---------------------
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- PSRAM -------------------------------------------------------------------
# Present (2 MB, in-package, quad) but not needed: the framebuffer is 115 KB
# and there is ~240 KB of internal heap free.  Enable if assets ever need it.
CONFIG_SPIRAM=n

# --- Display -----------------------------------------------------------------
# The panel is rated to 80 MHz.  A full 240x240 RGB565 frame is 115 KB, so the
# SPI clock is the frame-rate ceiling: 40 MHz gives about 23 ms per frame,
# 80 MHz about 11.5 ms.  Raise the backlight with `backlight 100`.
CONFIG_BSP_LCD_SPI_CLK_MHZ=80
CONFIG_BSP_BACKLIGHT_DEFAULT_PERCENT=60
